RegiXResources/RegiXAdapters/NBDAdapter/ValidPersonSearchRequest.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IRegiXEntryPoint/ExecuteSynchronous</a:Action>
    <a:MessageID>urn:uuid:a4ce2d14-84b0-4822-bfb5-61c7c84bde51</a:MessageID>
    <ActivityId CorrelationId="06c6c849-97b6-4083-99c4-524886fa5415" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">fd1f853e-a397-4040-8655-f1939f043deb</ActivityId>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <ExecuteSynchronous xmlns="http://tempuri.org/">
      <request>
        <Operation>TechnoLogica.RegiX.GraoNBDAdapter.APIService.INBDAPI.ValidPersonSearch</Operation>
        <Argument>
          <ValidPersonRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://egov.bg/RegiX/GRAO/NBD/ValidPersonRequest">
            <EGN>8506258485</EGN>
          </ValidPersonRequest>
        </Argument>
        <CallContext>
          <ServiceURI>132-11123-01.01.2016</ServiceURI>
          <ServiceType>За проверовъчна дейност</ServiceType>
          <EmployeeIdentifier>tl_ytoteva</EmployeeIdentifier>
          <EmployeeNames>Йорданка Тотева</EmployeeNames>
          <EmployeeAditionalIdentifier />
          <EmployeePosition>SW Developer</EmployeePosition>
          <AdministrationOId>2.16.100.1.1.1.1.15</AdministrationOId>
          <AdministrationName>Министерство на транспорта, информационните технологии и съобщенията</AdministrationName>
          <LawReason>За целите на разработката и тестването на RegiX.</LawReason>
          <Remark />
        </CallContext>
        <SignResult>true</SignResult>
        <ReturnAccessMatrix>true</ReturnAccessMatrix>
      </request>
    </ExecuteSynchronous>
  </s:Body>
</s:Envelope>